app/views/admin/artist.html.erb

    <dt><strong>Country</strong>:</dt>
    <dd><%= getCountryName(@artistInfo.country_id) %></dd>
---
SELECT `countries`.* FROM `countries` WHERE (id = 223 ) LIMIT 1