app/views/pages/home.html.erb

SELECT `contents`.* FROM `contents` WHERE (alias = 'fan-me-button' AND published = 1) LIMIT 1
---
                                      <%
                                      content = Content.where('alias = ? AND published = 1', 'fan-me-button').take