app/views/countries/_state_select.html.erb

  <% if !country_id.blank?  %>
  <% country = Country.find(country_id)  %>

  <% states = State.where("country_id = ?", country_id).all %>
---
SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 223 LIMIT 1
SELECT `states`.* FROM `states` WHERE (country_id = '223')