app/controllers/application_controller.rb

SELECT COUNT(*) FROM `users` WHERE (email = 'taylor.swift@gmail.com')
---
  def check_email

    if params[:email].present?
      user_email = params[:email]
    else
      user_email = params[:user][:email]
    end

    userExist = User.where("email = ?", user_email).count