app/controllers/countries_controller.rb

    def set_country
      @country = Country.find(params[:id])
---
SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 223 LIMIT 1