app/controllers/events_controller.rb

  def index
    @events = @user.events.paginate(:page => params[:page], :per_page => 10)
---
SELECT `events`.* FROM `events` WHERE `events`.`user_id` = 66 LIMIT 10 OFFSET 0

  def show


    # update hits
    @event.update_attributes(:hits => @event.hits.to_i + 1)
---
UPDATE `events` SET `hits` = 6, `updated_at` = '2014-01-20 08:11:04' WHERE `events`.`id` = 1

  def details
    @event = Event.find(params[:id])
    # update hits
    @event.update_attributes(:hits => @event.hits.to_i + 1)
---
SELECT `events`.* FROM `events` WHERE `events`.`id` = 1 LIMIT 1
UPDATE `events` SET `hits` = 8, `updated_at` = '2014-01-20 08:11:49' WHERE `events`.`id` = 1

    def load_user
      @user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 66 ORDER BY `users`.`id` ASC LIMIT 1