app/controllers/pages_controller.rb

SELECT `music_categories`.* FROM `music_categories`
---
  def genres
    allowedResultTypes = ["video","music"]
    @search = params[:search].to_s
    @cat_id = params[:cat_id].to_s
    @uploaded_time = params[:uploaded_time].to_s
    @result_type = params[:result_type].to_s
    if @result_type == ""
      @result_type = "video"
    end
    @duration = params[:duration].to_s
    @quality = params[:quality].to_s
    @sort_by = params[:sort_by].to_s
    if @sort_by == ""
      @sort_by = "upload-date"
    end
    @musicCategories = MusicCategory.all()

SELECT `users`.* FROM `users` WHERE `users`.`id` = 66 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 223 LIMIT 1
SELECT `states`.* FROM `states` WHERE `states`.`id` = 3 LIMIT 1
---
  def dashboard
    request_id = params[:id]
    @isMine = false
    if request_id == nil
      redirect_to('/') and return
    else
      @displayUser = User.find(request_id)
      if @displayUser == nil
        redirect_to('/') and return
      end

      if (current_user != nil && current_user.id == request_id) #not logged in
        @isMine = true
      end
    end

    #country state ...
    if @displayUser.country_id != nil
      country = Country.find(@displayUser.country_id)
    else
      country = nil
    end

    if @displayUser.state_id != nil
      state = State.find(@displayUser.state_id)

SELECT `videos`.* FROM `videos` WHERE (user_id IN('70') AND published=1) ORDER BY created_at DESC
---
      ## genre categories will be video categories, not audio categories
      @myMusicCategories = []
      myAudioIds = Video.where("user_id = ?",request_id).select(:id).distinct.order('created_at DESC')
      if myAudioIds.length > 0

SELECT `users`.* FROM `users` WHERE `users`.`id` = 71 ORDER BY `users`.`id` ASC LIMIT 1
SELECT `countries`.* FROM `countries` WHERE `countries`.`id` = 223 LIMIT 1
SELECT `states`.* FROM `states` WHERE `states`.`id` = 5 LIMIT 1
---
  def artist_fantistics
    request_id = params[:artist_id]
    @isMine = false
    if request_id == nil
      redirect_to('/') and return
    else
      @displayUser = User.find(request_id);
      if @displayUser == nil
        redirect_to('/') and return
      end

      if (current_user != nil && current_user.id == request_id) #not logged in
        @isMine = true
      end
    end

    #country state ...
    if @displayUser.country_id != nil
      country = Country.find(@displayUser.country_id)
    else
      country = nil
    end

    if @displayUser.state_id != nil
      state = State.find(@displayUser.state_id)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 71 ORDER BY `users`.`id` ASC LIMIT 1
---
  def become_fan
    artistid = params[:artistid]
    fanid = params[:fanid]

    if current_user == nil
      flash[:alert] = "You need to login to see this page."
      redirect_to(new_user_session_path) and return
    end

    #artistUser = User.where("id = ? AND user_type = 'artist'",artistid).take
    artistUser = User.where("id = ?",artistid).take