app/controllers/videos_controller.rb

SELECT `videos`.* FROM `videos` WHERE `videos`.`id` = 15 LIMIT 1
SELECT `video_watches`.* FROM `video_watches` WHERE (user_id=66) ORDER BY created_at DESC LIMIT 1
INSERT INTO `video_watches` (`created_at`, `ip`, `updated_at`, `user_id`, `video_id`) VALUES ('2014-01-20 08:13:15', '27.147.171.221', '2014-01-20 08:13:15', 66, 15)
SELECT COUNT(*) FROM `video_favorites` WHERE (user_id=66 AND video_id='15')
---
  def watch

    @video = Video.find(params[:id])
    @isFavoriteVideo = 0;
    # update hits
    if current_user != nil
      @userIP = request.remote_ip
      lastWatchedVideo = VideoWatch.where("user_id=?",current_user.id).order('created_at DESC').take
      insertWatchRow = true
      if lastWatchedVideo != nil && lastWatchedVideo.video_id.to_i == params[:id].to_i
        insertWatchRow = false
      end
      if insertWatchRow
        VideoWatch.create(:video_id=>params[:id],:user_id=>current_user.id,:ip=>@userIP)
      end
      @isFavoriteVideo = VideoFavorite.where("user_id=? AND video_id=?",current_user.id,params[:id]).count();

UPDATE `videos` SET `hits` = 5, `updated_at` = '2014-01-20 08:13:15' WHERE `videos`.`id` = 15
SELECT `comments`.* FROM `comments` WHERE (video_id=15) ORDER BY created_at DESC LIMIT 10 OFFSET 0
SELECT `users`.* FROM `users` WHERE `users`.`id` = 66 ORDER BY `users`.`id` ASC LIMIT 1
---
      @relatedVideos = @relatedVideos.where("music_categories_videos.music_category_id IN(?)",catdIdStr.split(',').map(&:to_i)).distinct().order('videos.created_at DESC').limit(Rails.application.config.related_video_count)
    end

    @video.update_attributes(:hits => @video.hits.to_i + 1)
    @comments = Comment.where("video_id=?",@video.id).order('created_at DESC').paginate(:page => params[:page], :per_page => 10)
    @videoCreator = User.find(@video.user_id)